src/cf/InformationRegisters/эв_ВыгруженныеОстаткиПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_ВыгруженныеОстаткиПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступныйОстаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/эв_КодыСтатусовПорталов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>эв_КодыСтатусовПорталов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КодПортала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсточникЗаказов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.эв_ИсточникиЗаказов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СостоянияЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.КатегорииНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Артикул характеристики</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КиЗГИСМGTIN</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.GTIN</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатурыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ДатаИзготовления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Декларант</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_МаркируемыйТовар</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганВыдавшийСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_ОрганЗарегистрировавшийДекларацию</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ор_Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СерияПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СертификатСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СрокДействияСертификата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_СтранаПроисхождения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_Фальсификат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ор_НаименованиеПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/эв_ОбменСПорталамиЭвалар/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыгрузитьОстатки(Источник, НастройкиAPI, ПолнаяВыгрузка) Экспорт

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API Эвалар");
		Возврат Ложь;
	КонецЕсли;

	Если Не ПолеЗаполнено(НастройкиAPI, "Пароль") Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнен SecureToken микросервиса остатков (поле Пароль)");
		Возврат Ложь;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(НастройкиAPI.Склад) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"У источника заказов не заполнен склад");
		Возврат Ложь;
	КонецЕсли;

	ТаблицаОстатков = ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка);
	ТаблицаКОтправке = ТаблицаОстатков.СкопироватьКолонки();
	ТаблицаКОтправке.Колонки.Добавить("Характеристика");
	МассивОстатков = Новый Массив;
	МассивЦен = Новый Массив;
	СобратьПакеты(ТаблицаОстатков, ТаблицаКОтправке, МассивОстатков, МассивЦен);
	Если МассивОстатков.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;

	ИдентификаторКаталога = КодМерчанта(НастройкиAPI);
	АдресОстатков = ХостМикросервиса(НастройкиAPI.Адрес) + "/amount/"
		+ КодироватьСтроку(ИдентификаторКаталога, СпособКодированияСтроки.КодировкаURL);
	Если Не ОтправитьПорции(Источник, НастройкиAPI, АдресОстатков, МассивОстатков, "amount") Тогда
		Возврат Ложь;
	КонецЕсли;

	Если МассивЦен.Количество() > 0 Тогда
		АдресЦен = ХостМикросервиса(НастройкиAPI.Адрес) + "/price/"
			+ КодироватьСтроку(ИдентификаторКаталога, СпособКодированияСтроки.КодировкаURL);
		Если Не ОтправитьПорции(Источник, НастройкиAPI, АдресЦен, МассивЦен, "price") Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;

	эв_ОбменСПорталамиСервер.ОбновитьСнимокОстатков(Источник, ТаблицаКОтправке, ПолнаяВыгрузка);
	Возврат Истина;

КонецФункции

Функция ЗагрузитьЗаказы(Источник, НастройкиAPI) Экспорт

	ТаблицаЗагруженных = НоваяТаблицаЗагруженныхЗаказов();

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнены настройки API Эвалар");
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	Город = СокрЛП(ЗначениеПоляНастройки(НастройкиAPI, "Логин"));
	Если Не ЗначениеЗаполнено(Город) Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Предупреждение, , Источник,
			"Не заполнен город сайта (поле Логин: moscow, spb или biysk)");
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("city", Город);
	ТелоЗапроса.Вставить("micro_point_id", КодМерчанта(НастройкиAPI));

	АдресЗапроса = ХостЗаказов(НастройкиAPI.Адрес) + "/local/tools/1c_exchange/as_order_exchange.php";
	РезультатHTTP = ВыполнитьЗапросСайта(Источник, НастройкиAPI, АдресЗапроса, ТелоЗапроса, "orders", 12);
	Если Не РезультатHTTP.Успех Тогда
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Ошибка, , Источник,
			РезультатHTTP.ТекстОшибки);
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	Если ТипЗнч(РезультатHTTP.Json) <> Тип("Массив") Или РезультатHTTP.Json.Количество() = 0 Тогда
		Возврат ТаблицаЗагруженных;
	КонецЕсли;

	ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, РезультатHTTP.Json, ТаблицаЗагруженных);
	Возврат ТаблицаЗагруженных;

КонецФункции

Функция ОтправитьСтатус(ПараметрыОчереди, НастройкиAPI) Экспорт

	Результат = Новый Структура("Успех, ТекстОшибки", Ложь, "");

	Если Не ДанныеПодключенияКорректны(НастройкиAPI) Тогда
		Результат.ТекстОшибки = "Не заполнены настройки API Эвалар";
		Возврат Результат;
	КонецЕсли;

	КодСтатуса = ВРег(СокрЛП(эв_ОбменСПорталамиСервер.КодСтатусаПортала(
		ПараметрыОчереди.ИсточникЗаказов, ПараметрыОчереди.СтатусЗаказа)));
	Если Не ЗначениеЗаполнено(КодСтатуса) Тогда
		Результат.ТекстОшибки = "Не задан код статуса портала для состояния заказа";
		Возврат Результат;
	КонецЕсли;

	НомерНаСайте = СокрЛП(эв_ОбменСПорталамиСервер.НомерЗаказаНаСайте(ПараметрыОчереди.ЗаказПокупателя));
	Если Не ЗначениеЗаполнено(НомерНаСайте) Тогда
		Результат.ТекстОшибки = "Не найден номер заказа на сайте";
		Возврат Результат;
	КонецЕсли;

	СостояниеНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);
	Если КодСтатуса = "N" Или ПараметрыОчереди.СтатусЗаказа = СостояниеНовый Тогда
		Успех = ПодтвердитьЗаказ(ПараметрыОчереди.ИсточникЗаказов, НастройкиAPI, НомерНаСайте, ПараметрыОчереди.ЗаказПокупателя);
		Результат.Успех = Успех;
		Если Не Успех Тогда
			Результат.ТекстОшибки = "Сайт не подтвердил получение заказа";
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;

	ТекстСтатуса = СокрЛП(Строка(ПараметрыОчереди.СтатусЗаказа));
	Успех = ОтправитьСтатусСайта(ПараметрыОчереди.ИсточникЗаказов, НастройкиAPI, НомерНаСайте, КодСтатуса,
		ТекстСтатуса, ПараметрыОчереди.ЗаказПокупателя);
	Результат.Успех = Успех;
	Если Не Успех Тогда
		Результат.ТекстОшибки = "Сайт не принял статус заказа";
	КонецЕсли;
	Возврат Результат;

КонецФункции

Функция ДанныеПодключенияКорректны(НастройкиAPI) Экспорт

	Если ТипЗнч(НастройкиAPI) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;

	Возврат ПолеЗаполнено(НастройкиAPI, "Адрес")
		И ПолеЗаполнено(НастройкиAPI, "auth_token")
		И ПолеЗаполнено(НастройкиAPI, "merchant");

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВыполнитьЗапросСайта(Источник, НастройкиAPI, Адрес, Тело, Контур, Таймаут, ЗаказПокупателя = Неопределено)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("Authorization", "Bearer " + СокрЛП(НастройкиAPI.auth_token));

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", "POST");
	ПараметрыЗапроса.Вставить("Адрес", Адрес);
	ПараметрыЗапроса.Вставить("Контур", Контур);
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Тело", Тело);
	ПараметрыЗапроса.Вставить("Таймаут", Таймаут);
	ПараметрыЗапроса.Вставить("ПарольДляМаскировки", НастройкиAPI.auth_token);
	Если ЗначениеЗаполнено(ЗаказПокупателя) Тогда
		ПараметрыЗапроса.Вставить("ЗаказПокупателя", ЗаказПокупателя);
	КонецЕсли;

	Возврат эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);

КонецФункции

Функция ВыполнитьЗапросМикросервиса(Источник, НастройкиAPI, Адрес, Тело, Контур)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("SecureToken", СокрЛП(НастройкиAPI.Пароль));

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИсточникЗаказов", Источник);
	ПараметрыЗапроса.Вставить("Метод", "POST");
	ПараметрыЗапроса.Вставить("Адрес", Адрес);
	ПараметрыЗапроса.Вставить("Контур", Контур);
	ПараметрыЗапроса.Вставить("Заголовки", Заголовки);
	ПараметрыЗапроса.Вставить("Тело", Тело);
	ПараметрыЗапроса.Вставить("Таймаут", 120);
	ПараметрыЗапроса.Вставить("ПарольДляМаскировки", НастройкиAPI.Пароль);

	Возврат эв_ОбменСПорталамиСервер.ВыполнитьЗапросHTTP(ПараметрыЗапроса);

КонецФункции

Функция ОтправитьПорции(Источник, НастройкиAPI, Адрес, МассивЭлементов, Контур)

	РазмерПорции = 10;
	Индекс = 0;
	Пока Индекс < МассивЭлементов.Количество() Цикл
		Порция = Новый Массив;
		Пока Порция.Количество() < РазмерПорции И Индекс < МассивЭлементов.Количество() Цикл
			Порция.Добавить(МассивЭлементов[Индекс]);
			Индекс = Индекс + 1;
		КонецЦикла;

		РезультатHTTP = ВыполнитьЗапросМикросервиса(Источник, НастройкиAPI, Адрес, Порция, Контур);
		Если Не РезультатHTTP.Успех Тогда
			ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Ошибка, , Источник,
				РезультатHTTP.ТекстОшибки);
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции

Функция ПолучитьОстаткиЦены(Источник, НастройкиAPI, ПолнаяВыгрузка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Остатки.Номенклатура КАК Номенклатура,
		|	Остатки.Характеристика КАК Характеристика,
		|	СУММА(Остатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Склад
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, СтруктурнаяЕдиница = &Склад) КАК Остатки
		|ГДЕ
		|	Остатки.Характеристика.ор_СрокГодности > &ГраницаСрока
		|
		|СГРУППИРОВАТЬ ПО
		|	Остатки.Номенклатура,
		|	Остатки.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Резервы.Номенклатура КАК Номенклатура,
		|	Резервы.Характеристика КАК Характеристика,
		|	СУММА(Резервы.КоличествоОстаток) КАК РезервОстаток
		|ПОМЕСТИТЬ ВТ_Резервы
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			,
		|			СтруктурнаяЕдиница = &Склад
		|				И ЗаказПокупателя <> ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Резервы
		|
		|СГРУППИРОВАТЬ ПО
		|	Резервы.Номенклатура,
		|	Резервы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Склад.Номенклатура КАК Номенклатура,
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0) < 1
		|				ТОГДА 0
		|			ИНАЧЕ ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0)
		|		КОНЕЦ) КАК ДоступныйОстаток
		|ПОМЕСТИТЬ ВТ_Учет
		|ИЗ
		|	ВТ_Склад КАК ВТ_Склад
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Резервы КАК ВТ_Резервы
		|		ПО ВТ_Склад.Номенклатура = ВТ_Резервы.Номенклатура
		|			И ВТ_Склад.Характеристика = ВТ_Резервы.Характеристика
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Склад.Номенклатура
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0) < 1
		|				ТОГДА 0
		|			ИНАЧЕ ВТ_Склад.КоличествоОстаток - ЕСТЬNULL(ВТ_Резервы.РезервОстаток, 0)
		|		КОНЕЦ) >= 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Снимок.Номенклатура КАК Номенклатура,
		|	СУММА(Снимок.ДоступныйОстаток) КАК ДоступныйОстаток,
		|	МАКСИМУМ(Снимок.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Снимок
		|ИЗ
		|	РегистрСведений.эв_ВыгруженныеОстаткиПорталов КАК Снимок
		|ГДЕ
		|	Снимок.ИсточникЗаказов = &Источник
		|
		|СГРУППИРОВАТЬ ПО
		|	Снимок.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_ИнтернетЦена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|				И ВидЦен.Наименование = ""Интернет цена (Сокол)"") КАК Цены
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦенаБезХарактеристики
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			,
		|			ВидЦен = &ВидЦен
		|				И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Цены
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Цены.Номенклатура КАК Номенклатура,
		|	МИНИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_МинимальнаяЦена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, ВидЦен = &ВидЦен) КАК Цены
		|ГДЕ
		|	Цены.Цена > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТ_Учет.Номенклатура, ВТ_Снимок.Номенклатура) КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Учет.ДоступныйОстаток, 0) КАК ДоступныйОстаток,
		|	ЕСТЬNULL(ВТ_Снимок.Цена, 0) КАК ЦенаСнимка
		|ПОМЕСТИТЬ ВТ_Ключи
		|ИЗ
		|	ВТ_Учет КАК ВТ_Учет
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_Снимок КАК ВТ_Снимок
		|		ПО ВТ_Учет.Номенклатура = ВТ_Снимок.Номенклатура
		|ГДЕ
		|	ВЫБОР
		|			КОГДА &ПолнаяВыгрузка
		|				ТОГДА ИСТИНА
		|			КОГДА ВТ_Учет.Номенклатура ЕСТЬ NULL
		|				ТОГДА ЕСТЬNULL(ВТ_Снимок.ДоступныйОстаток, 0) > 0
		|			КОГДА ВТ_Снимок.Номенклатура ЕСТЬ NULL
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ЕСТЬNULL(ВТ_Учет.ДоступныйОстаток, 0) <> ЕСТЬNULL(ВТ_Снимок.ДоступныйОстаток, 0)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Ключи.Номенклатура КАК Номенклатура,
		|	ВТ_Ключи.ДоступныйОстаток КАК ДоступныйОстаток,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТ_ИнтернетЦена.Цена, 0) > 0
		|			ТОГДА ВТ_ИнтернетЦена.Цена
		|		КОГДА ВРЕГ(ЕСТЬNULL(ВТ_Ключи.Номенклатура.ЦеноваяГруппа.Наименование, """")) = ""ЭВАЛАР""
		|				И ЕСТЬNULL(ВТ_ЦенаБезХарактеристики.Цена, 0) > 0
		|			ТОГДА ВТ_ЦенаБезХарактеристики.Цена
		|		ИНАЧЕ ЕСТЬNULL(ВТ_МинимальнаяЦена.Цена, ВТ_Ключи.ЦенаСнимка)
		|	КОНЕЦ КАК Цена,
		|	ВТ_Ключи.Номенклатура.ВидСтавкиНДС КАК ВидСтавкиНДС
		|ИЗ
		|	ВТ_Ключи КАК ВТ_Ключи
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтернетЦена КАК ВТ_ИнтернетЦена
		|		ПО ВТ_Ключи.Номенклатура = ВТ_ИнтернетЦена.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЦенаБезХарактеристики КАК ВТ_ЦенаБезХарактеристики
		|		ПО ВТ_Ключи.Номенклатура = ВТ_ЦенаБезХарактеристики.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МинимальнаяЦена КАК ВТ_МинимальнаяЦена
		|		ПО ВТ_Ключи.Номенклатура = ВТ_МинимальнаяЦена.Номенклатура";

	Запрос.УстановитьПараметр("Склад", НастройкиAPI.Склад);
	Запрос.УстановитьПараметр("ВидЦен", НастройкиAPI.ВидЦен);
	Запрос.УстановитьПараметр("Источник", Источник);
	Запрос.УстановитьПараметр("ПолнаяВыгрузка", ПолнаяВыгрузка);
	Запрос.УстановитьПараметр("ГраницаСрока", КонецДня(ТекущаяДатаСеанса()) + 86400);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Процедура СобратьПакеты(ТаблицаОстатков, ТаблицаКОтправке, МассивОстатков, МассивЦен)

	СтавкиНДС = Новый Соответствие;
	ПустаяХарактеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();

	Для Каждого СтрокаОстатка Из ТаблицаОстатков Цикл

		Количество = Цел(СтрокаОстатка.ДоступныйОстаток);
		Если Количество < 0 Тогда
			Количество = 0;
		КонецЕсли;
		Если (Не ЗначениеЗаполнено(СтрокаОстатка.Цена) Или СтрокаОстатка.Цена = 0) И Количество > 0 Тогда
			Продолжить;
		КонецЕсли;

		СтрокаКОтправке = ТаблицаКОтправке.Добавить();
		СтрокаКОтправке.Номенклатура = СтрокаОстатка.Номенклатура;
		СтрокаКОтправке.Характеристика = ПустаяХарактеристика;
		СтрокаКОтправке.Цена = ?(ЗначениеЗаполнено(СтрокаОстатка.Цена), СтрокаОстатка.Цена, 0);
		СтрокаКОтправке.ДоступныйОстаток = Количество;

		ИдентификаторТовара = XMLСтрока(СтрокаОстатка.Номенклатура);
		ПозицияОстатка = Новый Структура;
		ПозицияОстатка.Вставить("product", ИдентификаторТовара);
		ПозицияОстатка.Вставить("amount", Количество);
		МассивОстатков.Добавить(ПозицияОстатка);

		Если СтрокаКОтправке.Цена > 0 Тогда
			ПозицияЦены = Новый Структура;
			ПозицияЦены.Вставить("product", ИдентификаторТовара);
			ПозицияЦены.Вставить("price", СтрокаКОтправке.Цена);
			ПозицияЦены.Вставить("vat_percentage", СтавкаНДСДляВыгрузки(СтрокаОстатка.ВидСтавкиНДС, СтавкиНДС));
			МассивЦен.Добавить(ПозицияЦены);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция СтавкаНДСДляВыгрузки(ВидСтавкиНДС, СтавкиНДС)

	Если Не ЗначениеЗаполнено(ВидСтавкиНДС) Или ВидСтавкиНДС = Перечисления.ВидыСтавокНДС.БезНДС Тогда
		Возврат -1;
	КонецЕсли;

	СохраненнаяСтавка = СтавкиНДС.Получить(ВидСтавкиНДС);
	Если СохраненнаяСтавка <> Неопределено Тогда
		Возврат СохраненнаяСтавка;
	КонецЕсли;

	СтавкаСсылка = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДС, ТекущаяДатаСеанса());
	ЗначениеСтавки = -1;
	Если ЗначениеЗаполнено(СтавкаСсылка) Тогда
		РеквизитыСтавки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтавкаСсылка, "НеОблагается, Ставка");
		Если РеквизитыСтавки.НеОблагается <> Истина И ЗначениеЗаполнено(РеквизитыСтавки.Ставка) Тогда
			ЗначениеСтавки = РеквизитыСтавки.Ставка;
		КонецЕсли;
	КонецЕсли;

	СтавкиНДС.Вставить(ВидСтавкиНДС, ЗначениеСтавки);
	Возврат ЗначениеСтавки;

КонецФункции

Процедура ЗагрузитьЗаказыИзJSON(Источник, НастройкиAPI, СписокЗаказов, ТаблицаЗагруженных)

	СостояниеОтмены = СостояниеПоКодуПортала(Источник, "FO");

	Для Каждого ЗаказПортала Из СписокЗаказов Цикл

		СтатусСайта = ВРег(СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ЗначениеПоляJSON(ЗаказПортала, "status"), "id"))));
		Если СтатусСайта <> "N" Тогда
			Продолжить;
		КонецЕсли;

		НомерНаСайте = НомерЗаказаСайта(ЗначениеПоляJSON(ЗаказПортала, "id"));
		Если Не ЗначениеЗаполнено(НомерНаСайте) Тогда
			Продолжить;
		КонецЕсли;

		ЗаказОтменен = БулевоИзJSON(ЗначениеПоляJSON(ЗаказПортала, "isCanceled"));
		СуществующийЗаказ = эв_ОбменСПорталамиСервер.НайтиЗаказПоНомеруНаСайте(НомерНаСайте, Источник);
		ЕстьОшибки = Ложь;
		ЗаказСсылка = СуществующийЗаказ;

		Если ЗначениеЗаполнено(СуществующийЗаказ) Тогда
			Если ЗаказОтменен Тогда
				ОтменитьЗаказНаСайте(СуществующийЗаказ, Источник, СостояниеОтмены);
			КонецЕсли;
			ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, СуществующийЗаказ, НомерНаСайте, Ложь);
		ИначеЕсли Не ЗаказОтменен Тогда
			ДанныеЗаказа = РазобратьЗаказ(ЗаказПортала, НомерНаСайте, ЕстьОшибки);
			Попытка
				ЗаказСсылка = эв_ОбменСПорталамиСервер.СоздатьЗаказПортала(Источник, НастройкиAPI, ДанныеЗаказа);
			Исключение
				ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Ошибка, , Источник,
					СтрШаблон("Ошибка создания заказа %1: %2", НомерНаСайте, ОписаниеОшибки()));
				Продолжить;
			КонецПопытки;
			Если Не ЗначениеЗаполнено(ЗаказСсылка) Тогда
				Продолжить;
			КонецЕсли;
			ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказСсылка, НомерНаСайте, Истина);
		КонецЕсли;

		Если ЕстьОшибки Тогда
			ОтправитьСтатусСайта(Источник, НастройкиAPI, НомерНаСайте, "ER", "Не сопоставлена номенклатура", ЗаказСсылка);
		КонецЕсли;

		Если Не ПодтвердитьЗаказ(Источник, НастройкиAPI, НомерНаСайте, ЗаказСсылка)
			И ЗначениеЗаполнено(ЗаказСсылка)
			И Не ЗначениеЗаполнено(СуществующийЗаказ) Тогда
			ПоставитьЗаказНовыйВОчередь(ЗаказСсылка, Источник, НастройкиAPI);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

Функция РазобратьЗаказ(ЗаказПортала, НомерНаСайте, ЕстьОшибки)

	Покупатель = ЗначениеПоляJSON(ЗаказПортала, "customer");
	Оплата = ЗначениеПоляJSON(ЗаказПортала, "payment");
	Доставка = ЗначениеПоляJSON(ЗаказПортала, "delivery");
	ТекстЗаказа = "";
	Попытка
		ТекстЗаказа = КоннекторHTTP.ОбъектВJson(ЗаказПортала);
	Исключение
		ТекстЗаказа = "";
	КонецПопытки;

	Комментарий = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "comment")));
	ИдентификаторДоставки = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(Доставка, "id")));
	Если ИдентификаторДоставки <> "41" И ИдентификаторДоставки <> "66" Тогда
		АдресДоставки = СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(Доставка, "address")));
		Если ЗначениеЗаполнено(АдресДоставки) Тогда
			Комментарий = СокрЛП(Комментарий + " Доставка: " + АдресДоставки);
		КонецЕсли;
	КонецЕсли;

	ДанныеЗаказа = Новый Структура;
	ДанныеЗаказа.Вставить("НомерНаСайте", НомерНаСайте);
	ДанныеЗаказа.Вставить("Дата", ДатаЗаказаСайта(СтрокаИзJSON(ЗначениеПоляJSON(ЗаказПортала, "createdAt"))));
	ДанныеЗаказа.Вставить("Фамилия", СтрокаИзJSON(ЗначениеПоляJSON(Покупатель, "surname")));
	ДанныеЗаказа.Вставить("Имя", СтрокаИзJSON(ЗначениеПоляJSON(Покупатель, "name")));
	ДанныеЗаказа.Вставить("Отчество", СтрокаИзJSON(ЗначениеПоляJSON(Покупатель, "middleName")));
	ДанныеЗаказа.Вставить("Почта", СтрокаИзJSON(ЗначениеПоляJSON(Покупатель, "email")));
	ДанныеЗаказа.Вставить("Телефон", ПривестиТелефон(СтрокаИзJSON(ЗначениеПоляJSON(Покупатель, "phone"))));
	ДанныеЗаказа.Вставить("Комментарий", Комментарий);
	ДанныеЗаказа.Вставить("ИсходныйПакетJSON", ТекстЗаказа);
	ДанныеЗаказа.Вставить("ОплаченНаПортале", БулевоИзJSON(ЗначениеПоляJSON(Оплата, "isPayed")));
	ДанныеЗаказа.Вставить("Товары", Новый Массив);

	Корзина = ЗначениеПоляJSON(ЗаказПортала, "basket");
	Если ТипЗнч(Корзина) <> Тип("Массив") Или Корзина.Количество() = 0 Тогда
		ЕстьОшибки = Истина;
		Возврат ДанныеЗаказа;
	КонецЕсли;

	Для Каждого СтрокаКорзины Из Корзина Цикл
		Номенклатура = НоменклатураПоXmlId(ЗначениеПоляJSON(СтрокаКорзины, "xmlId"));
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;

		СтрокаТовара = Новый Структура;
		СтрокаТовара.Вставить("ИдПозиции", СокрЛП(СтрокаИзJSON(ЗначениеПоляJSON(СтрокаКорзины, "xmlId"))));
		СтрокаТовара.Вставить("Номенклатура", Номенклатура);
		СтрокаТовара.Вставить("Характеристика", Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
		СтрокаТовара.Вставить("Количество", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаКорзины, "quantity")));
		СтрокаТовара.Вставить("Цена", ЧислоИзJSON(ЗначениеПоляJSON(СтрокаКорзины, "price")));
		ДанныеЗаказа.Товары.Добавить(СтрокаТовара);
	КонецЦикла;

	Возврат ДанныеЗаказа;

КонецФункции

Функция НоменклатураПоXmlId(Идентификатор)

	ТекстИдентификатора = СокрЛП(СтрокаИзJSON(Идентификатор));
	Если Не ЗначениеЗаполнено(ТекстИдентификатора) Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Если СтрДлина(ТекстИдентификатора) < 15 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Код = &Код
			|	И НЕ Номенклатура.ПометкаУдаления
			|	И НЕ Номенклатура.ЭтоГруппа";
		Запрос.УстановитьПараметр("Код", ТекстИдентификатора);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;

	Возврат эв_ОбменСПорталамиСервер.НоменклатураПоИдентификаторуПортала(ТекстИдентификатора);

КонецФункции

Функция ПодтвердитьЗаказ(Источник, НастройкиAPI, НомерНаСайте, ЗаказПокупателя)

	ТелоЗапроса = Новый Структура("id", НомерНаСайте);
	АдресЗапроса = ХостЗаказов(НастройкиAPI.Адрес) + "/local/tools/1c_exchange/as_order_sent.php";
	РезультатHTTP = ВыполнитьЗапросСайта(Источник, НастройкиAPI, АдресЗапроса, ТелоЗапроса, "orderSent", 12, ЗаказПокупателя);
	Если ОтветСайтаПринят(РезультатHTTP) Тогда
		Возврат Истина;
	КонецЕсли;

	ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Ошибка, , Источник,
		СтрШаблон("Не подтвержден заказ %1. %2", НомерНаСайте, РезультатHTTP.ТекстОшибки));
	Возврат Ложь;

КонецФункции

Функция ОтправитьСтатусСайта(Источник, НастройкиAPI, НомерНаСайте, КодСтатуса, ТекстСтатуса, ЗаказПокупателя)

	Статус = Новый Структура;
	Статус.Вставить("id", КодСтатуса);
	Статус.Вставить("text", ТекстСтатуса);

	Элемент = Новый Структура;
	Элемент.Вставить("id", НомерНаСайте);
	Элемент.Вставить("status", Статус);

	Пакет = Новый Массив;
	Пакет.Добавить(Элемент);

	АдресЗапроса = ХостЗаказов(НастройкиAPI.Адрес) + "/local/tools/1c_exchange/as_status_exchange.php";
	РезультатHTTP = ВыполнитьЗапросСайта(Источник, НастройкиAPI, АдресЗапроса, Пакет, "setStatus", 12, ЗаказПокупателя);
	Возврат ОтветСайтаПринят(РезультатHTTP);

КонецФункции

Функция ОтветСайтаПринят(РезультатHTTP)

	Если Не РезультатHTTP.Успех Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ТипЗнч(РезультатHTTP.Json) = Тип("Массив") Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипЗнч(РезультатHTTP.Json) <> Тип("Соответствие") И ТипЗнч(РезультатHTTP.Json) <> Тип("Структура") Тогда
		Возврат Истина;
	КонецЕсли;

	Возврат ВРег(СтрокаИзJSON(ЗначениеПоляJSON(РезультатHTTP.Json, "STATUS"))) = "SUCCESS";

КонецФункции

Функция СостояниеПоКодуПортала(Источник, КодПортала)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Коды.ВидСтатуса КАК ВидСтатуса
		|ИЗ
		|	РегистрСведений.эв_КодыСтатусовПорталов КАК Коды
		|ГДЕ
		|	Коды.ИсточникЗаказов = &ИсточникЗаказов
		|	И Коды.КодПортала = &КодПортала
		|	И Коды.Используется";
	Запрос.УстановитьПараметр("ИсточникЗаказов", Источник);
	Запрос.УстановитьПараметр("КодПортала", КодПортала);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ВидСтатуса;
	КонецЕсли;

	Возврат Справочники.СостоянияЗаказовПокупателей.ПустаяСсылка();

КонецФункции

Процедура ОтменитьЗаказНаСайте(ЗаказПокупателя, Источник, СостояниеОтмены)

	Попытка
		эв_ОбменСПорталамиСервер.ОтменитьЗаказПортала(ЗаказПокупателя, Источник, СостояниеОтмены);
	Исключение
		ЗаписьЖурналаРегистрации("Обмен с порталами.Эвалар", УровеньЖурналаРегистрации.Ошибка, , Источник,
			СтрШаблон("Ошибка отмены заказа: %1", ОписаниеОшибки()));
	КонецПопытки;

КонецПроцедуры

Процедура ПоставитьЗаказНовыйВОчередь(ЗаказПокупателя, Источник, НастройкиAPI)

	СтатусНовый = эв_ОбменСПорталамиСервер.СостояниеНовыйЗаказа(НастройкиAPI.Вид);
	Если ЗначениеЗаполнено(СтатусНовый) Тогда
		эв_ОбменСПорталамиСервер.ПоставитьЗаказВОчередьСтатусов(ЗаказПокупателя, Источник, СтатусНовый, , Истина);
	КонецЕсли;

КонецПроцедуры

Функция ХостМикросервиса(Адрес)

	Возврат "http://" + ИмяХоста(Адрес);

КонецФункции

Функция ХостЗаказов(Адрес)

	Возврат "https://" + ИмяХоста(Адрес);

КонецФункции

Функция ИмяХоста(Адрес)

	Текст = СокрЛП(Адрес);
	НРегТекст = НРег(Текст);
	Если СтрНачинаетсяС(НРегТекст, "https://") Тогда
		Текст = Сред(Текст, 9);
	ИначеЕсли СтрНачинаетсяС(НРегТекст, "http://") Тогда
		Текст = Сред(Текст, 8);
	КонецЕсли;

	ПозицияСлеша = СтрНайти(Текст, "/");
	Если ПозицияСлеша > 1 Тогда
		Текст = Лев(Текст, ПозицияСлеша - 1);
	КонецЕсли;

	Возврат Текст;

КонецФункции

Функция КодМерчанта(НастройкиAPI)

	Возврат СокрЛП(НастройкиAPI.merchant);

КонецФункции

Функция НомерЗаказаСайта(ЗначениеПоля)

	Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
		Возврат Формат(ЗначениеПоля, "ЧГ=");
	КонецЕсли;

	Текст = СтрокаИзJSON(ЗначениеПоля);
	Текст = СтрЗаменить(Текст, " ", "");
	Текст = СтрЗаменить(Текст, Символы.НПП, "");
	Возврат Текст;

КонецФункции

Функция ДатаЗаказаСайта(ТекстДаты)

	Текст = СокрЛП(ТекстДаты);
	Если СтрДлина(Текст) >= 10 И Сред(Текст, 5, 1) = "-" Тогда
		Попытка
			Время = "000000";
			Если СтрДлина(Текст) >= 19 Тогда
				Время = Сред(Текст, 12, 2) + Сред(Текст, 15, 2) + Сред(Текст, 18, 2);
			КонецЕсли;
			Возврат Дата(Лев(Текст, 4) + Сред(Текст, 6, 2) + Сред(Текст, 9, 2) + Время);
		Исключение
			Возврат ТекущаяДатаСеанса();
		КонецПопытки;
	КонецЕсли;

	Если СтрДлина(Текст) >= 10 И Сред(Текст, 3, 1) = "." Тогда
		Попытка
			Возврат Дата(Сред(Текст, 7, 4) + Сред(Текст, 4, 2) + Лев(Текст, 2));
		Исключение
			Возврат ТекущаяДатаСеанса();
		КонецПопытки;
	КонецЕсли;

	Возврат ТекущаяДатаСеанса();

КонецФункции

Функция ПривестиТелефон(Телефон)

	Цифры = "";
	Для НомерСимвола = 1 По СтрДлина(Телефон) Цикл
		Символ = Сред(Телефон, НомерСимвола, 1);
		Если СтрНайти("0123456789", Символ) > 0 Тогда
			Цифры = Цифры + Символ;
		КонецЕсли;
	КонецЦикла;

	Если СтрДлина(Цифры) = 11 И Лев(Цифры, 1) = "8" Тогда
		Цифры = "7" + Сред(Цифры, 2);
	ИначеЕсли СтрДлина(Цифры) = 10 Тогда
		Цифры = "7" + Цифры;
	КонецЕсли;

	Возврат Цифры;

КонецФункции

Функция НоваяТаблицаЗагруженныхЗаказов()

	ТаблицаЗагруженных = Новый ТаблицаЗначений;
	ТаблицаЗагруженных.Колонки.Добавить("ЗаказПокупателя", Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя"));
	ТаблицаЗагруженных.Колонки.Добавить("НомерЗаказаНаСайте", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТаблицаЗагруженных.Колонки.Добавить("ЭтоНовый", Новый ОписаниеТипов("Булево"));
	Возврат ТаблицаЗагруженных;

КонецФункции

Процедура ДобавитьСтрокуЗагруженных(ТаблицаЗагруженных, ЗаказПокупателя, НомерНаСайте, ЭтоНовый)

	СтрокаТаблицы = ТаблицаЗагруженных.Добавить();
	СтрокаТаблицы.ЗаказПокупателя = ЗаказПокупателя;
	СтрокаТаблицы.НомерЗаказаНаСайте = НомерНаСайте;
	СтрокаТаблицы.ЭтоНовый = ЭтоНовый;

КонецПроцедуры

Функция ПолеЗаполнено(НастройкиAPI, ИмяПоля)

	Возврат ЗначениеЗаполнено(ЗначениеПоляНастройки(НастройкиAPI, ИмяПоля));

КонецФункции

Функция ЗначениеПоляНастройки(НастройкиAPI, ИмяПоля)

	ЗначениеПоля = Неопределено;
	Если ТипЗнч(НастройкиAPI) = Тип("Структура") И НастройкиAPI.Свойство(ИмяПоля, ЗначениеПоля) Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

Функция ЗначениеПоляJSON(ОбъектJSON, ИмяПоля)

	Если ТипЗнч(ОбъектJSON) = Тип("Соответствие") Тогда
		Возврат ОбъектJSON.Получить(ИмяПоля);
	ИначеЕсли ТипЗнч(ОбъектJSON) = Тип("Структура") Тогда
		ЗначениеПоля = Неопределено;
		ОбъектJSON.Свойство(ИмяПоля, ЗначениеПоля);
		Возврат ЗначениеПоля;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция СтрокаИзJSON(ЗначениеПоля)

	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат "";
	КонецЕсли;
	Возврат СокрЛП(Строка(ЗначениеПоля));

КонецФункции

Функция ЧислоИзJSON(ЗначениеПоля)

	Если Не ЗначениеЗаполнено(ЗначениеПоля) Тогда
		Возврат 0;
	КонецЕсли;
	Если ТипЗнч(ЗначениеПоля) = Тип("Число") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;
	Попытка
		Возврат Число(ЗначениеПоля);
	Исключение
		Возврат 0;
	КонецПопытки;

КонецФункции

Функция БулевоИзJSON(ЗначениеПоля)

	Если ТипЗнч(ЗначениеПоля) = Тип("Булево") Тогда
		Возврат ЗначениеПоля;
	КонецЕсли;

	Текст = НРег(СтрокаИзJSON(ЗначениеПоля));
	Возврат Текст = "true" Или Текст = "истина" Или Текст = "1";

КонецФункции

#КонецОбласти
